
kIKPathPopupOther = "Other…";
kIKPathPopupChoose = "Choose";

/* ----- IKDeviceBrowserView ----- */

kIKDeviceBrowserLocalCameras = "Local Cameras";
kIKDeviceBrowserNetworkCameras = "Network Cameras";
kIKDeviceBrowserLocalScanners = "Local Scanners";
kIKDeviceBrowserNetworkScanners = "Network Scanners";
kIKDeviceBrowserNoPostprocessApplication = "No application";

kIKDeviceBrowserOutlineViewLocalDevices = "DEVICES";
kIKDeviceBrowserOutlineViewRemoteDevices = "SHARED";

kIKDeviceBrowserShowDeviceSettingsToolTip = "Show device settings";
kIKDeviceBrowserHideDeviceSettingsToolTip = "Hide device settings";
kIKDeviceBrowserShowDeviceSettingsAX = "show device settings";
kIKDeviceBrowserHideDeviceSettingsAX = "hide device settings";

kIKDeviceBrowserShowNetworkDevicesToolTip = "Show network devices";
kIKDeviceBrowserHideNetworkDevicesToolTip = "Hide network devices";
kIKDeviceBrowserShowNetworkDevicesAX = "show network devices";
kIKDeviceBrowserHideNetworkDevicesAX = "hide network devices";

kIKDeviceBrowserDevicesAX = "cameras and scanners";

kIKDeviceBrowserAccessoryConnectingDevice = "Connecting this %@ opens:";
device = "device";
iPod = "iPod";
iPhone = "iPhone";
Camera = "camera";
Scanner = "scanner";
kIKDeviceBrowserAccessoryShareDevice = "Share %@";

kIKDeviceBrowserTextCellLocal = "local";
kIKDeviceBrowserTextCellNetwork = "network";
kIKDeviceBrowserTextCellItemCount = "%d items";

ICDeviceLocationDescriptionUSB = "USB";
ICDeviceLocationDescriptionFireWire = "FireWire";
ICDeviceLocationDescriptionBluetooth = "Bluetooth";
ICDeviceLocationDescriptionMassStorage = "MassStorage";

kIKDeviceWasDisconnected = "‘%@’ was disconnected…";

/* ----- IKCameraDeviceView ----- */

kIKCameraDeviceView_DownloadAll = "Download All";
kIKCameraDeviceView_Download = "Download";
kIKCameraDeviceView_ImportAll = "Import All";
kIKCameraDeviceView_Import = "Import";

kIKCameraDeviceView_NoPostProcessingApplication = "No Application";

kIKCameraDeviceView_StatusText_DownloadSelectedItems = "Importing selected items";
kIKCameraDeviceView_StatusText_DownloadAllItems = "Importing all items";
kIKCameraDeviceView_StatusText_DownloadingItem = "Importing “%@”";

kIKCameraDeviceView_FileSizeByteFormat = "%@ B";
kIKCameraDeviceView_FileSizeKBFormat = "%@ KB";
kIKCameraDeviceView_FileSizeMBFormat = "%@ MB";
kIKCameraDeviceView_FileSizeGBFormat = "%@ GB";

kIKCameraDeviceView_ApertureFormat = "ƒ/%@";
kIKCameraDeviceView_FocalLengthFormat = "%@ mm";

kIKCameraLocalizedOK                              = "OK";
kIKCameraDeviceDisconnectedWhileDownloading       = "Camera disconnected while importing";
kIKCameraDeviceDisconnectedWhileDownloadingText   = "The camera “%@” was disconnected while importing. %d items were not imported.";
kIKCameraDeviceDisconnectedWhileDeleting          = "Camera disconnected while deleting";
kIKCameraDeviceDisconnectedWhileDeletingText      = "The camera “%@” was disconnected while deleting. Some items may not be deleted.";

kIKCameraDeviceCouldNotDownloadAllItems            = "Import error."; 
kIKCameraDeviceCouldNotDownloadAllItemsText        = "An error occured while importing. The item ‘%@” was not imported.";
kIKCameraDeviceCouldNotDownloadAllItemsText2       = "An error occured while importing. %d items were not imported:\n";
kIKCameraDeviceCouldNotDownloadAllItemsButton      = "OK";

kIKCameraDeviceView_CancelButton                   = "Cancel";

kIKCameraDeviceView_DeleteSelectedItem = "Are you sure you want to delete the selected item permanently?";
kIKCameraDeviceView_DeleteSelectedItemsFormat = "Are you sure you want to delete the selected %d items permanently?";
kIKCameraDeviceView_DeleteText = "You cannot undo this action.";
kIKCameraDeviceView_DeleteButton = "Delete";
kIKCameraDeviceView_DeleteCancel = "Cancel";

kIKCameraDeviceView_DiskFull = "Disk Full";
kIKCameraDeviceView_DiskFullText = "There is not enough space on the volume ”%@” to import the selected items. Please select a new import folder on a different volume.";
kIKCameraDeviceView_DownloadFolderNotAvailable = "Import folder not available";
kIKCameraDeviceView_DownloadFolderNotAvailableText = "The specified import folder is not available or cannot be found. Please select a new import folder.";
kIKCameraDeviceView_DownloadFolderWriteProtected = "Cannot import";
kIKCameraDeviceView_DownloadFolderWriteProtectedText = "You don’t have write permissions for the specified import folder. Please select a different import folder.";

/* ----- IKScannerDeviceView ----- */

kIKScannerDeviceView_ScanButton = "Scan";
kIKScannerDeviceView_OverviewButton = "Overview";
kIKScannerDeviceView_CancelButton = "Cancel";
kIKScannerDeviceView_ImportButton = "Import";

kIKScannerDeviceView_PressScanToStart = "Press “Scan” to start…";

kIKScannerDeviceView_Simple = "Simple";
kIKScannerDeviceView_Advanced = "Advanced";

kIKScannerDeviceView_ScanDocumentName = "Scan";

kIKScannerDeviceView_ScannerNotAvailable = "Scanner not available";
kIKScannerDeviceView_NoScannerSelected = "No scanner selected";
kIKScannerDeviceView_NoScannerDeviceAvailable = "No scanner device available";
kIKScannerDeviceView_ScannerIsWarmingUp = "Scanner is warming up…";
kIKScannerDeviceView_ScannerReportedAnError = "Scanner reported an error";
kIKScannerDeviceView_ScannerReportedAnErrorOK = "OK";
kIKScannerDeviceView_TryingToOpenScannerSession = "Trying to open scanner session…";


kIKScannerDeviceView_NoPostProcessingApplication = "No Application";

kIKScannerDeviceView_StatusText_OverviewScan = "Overview scan…";
kIKScannerDeviceView_StatusText_Scan = "Scanning…";
kIKScannerDeviceView_StatusText_ScanDocument = "Scanning document #%d";
kIKScannerDeviceView_StatusText_ScanDocumentName = "Scanning document ‘%@’";
kIKScannerDeviceView_StatusText_ScanDocumentNameAndPage = "Scanning document ‘%@’ Page #%d";

kIKScannerDeviceView_Units_pixels = "pixels";
kIKScannerDeviceView_Units_inches = "inches";
kIKScannerDeviceView_Units_cm = "cm";

kIKScannerDeviceView_Units = "units";

kIKScannerDeviceFileNameCannotContainColon = "File name cannot contain a ‘:’.";
kIKScannerDeviceFileNameCannotBeEmpty = "File name cannot be empty";
kIKScannerDeviceFileNameIsTooLong = "File name is too long";
kIKScannerDeviceFileNameCannotStartWithADot = "File name cannot start with a ‘.’.";

kIKScannerDeviceFileRangeErrorValueTooSmall = "The value ”%@” is too small (Minimum value is %@).";
kIKScannerDeviceFileRangeErrorValueTooBig = "The value ”%@” is too big (Maximum value is %@).";
kIKScannerDeviceFileRangeErrorValueInvalid = "The value ”%@” is invalid.";

kIKScannerDeviceView_SimpleScanImageTitle = "Scan %d";
kIKScannerDeviceView_SimpleScanAnalyzing = "Analyzing…";

kIKScannerDeviceView_Advanced_ScanMode = "Scan Mode:";
kIKScannerDeviceView_Advanced_ScanModeFlatbed = "Flatbed";
kIKScannerDeviceView_Advanced_ScanModeTransparency = "Transparency";
kIKScannerDeviceView_Advanced_ScanModePositiveTransparency = "Transparency - Positive";
kIKScannerDeviceView_Advanced_ScanModeNegativeTransparency = "Transparency - Negative";
kIKScannerDeviceView_Advanced_ScanModeDocumentFeeder = "Document Feeder";

kIKScannerDeviceView_Advanced_DocumentType = "Kind:";
kIKScannerDeviceView_Advanced_DocumentTypeText = "Text";
kIKScannerDeviceView_Advanced_DocumentTypeBWPhoto = "Black & White";
kIKScannerDeviceView_Advanced_DocumentTypeColorPhoto = "Color";
kIKScannerDeviceView_Advanced_DocumentTypePositiveGray = "Positive Gray";
kIKScannerDeviceView_Advanced_DocumentTypeColorSlide = "Color Slide";
kIKScannerDeviceView_Advanced_DocumentTypeNegativeGray = "Negative Gray";
kIKScannerDeviceView_Advanced_DocumentTypeNegativeSlide = "Negative Slide";

kIKScannerDeviceView_Advanced_BitDepth = "Bit Depth:";
kIKScannerDeviceView_Advanced_BitDepthBit = "1 Bit";
kIKScannerDeviceView_Advanced_BitDepthBits = "%d Bits";

kIKScannerDeviceView_Advanced_BitDepthColors = "Colors:";
kIKScannerDeviceView_Advanced_BitDepthGrays = "Grays:";

kIKScannerDeviceView_Advanced_BitDepthRGB8 = "Millions";
kIKScannerDeviceView_Advanced_BitDepthRGB16 = "Billions";

kIKScannerDeviceView_Advanced_BitDepthGray8 = "256 Grays";
kIKScannerDeviceView_Advanced_BitDepthGray16 = "Thousands of Grays";

kIKScannerDeviceView_Advanced_BitDepthBW1 = "Black & White";

kIKScannerDeviceView_Advanced_Rotation = "Rotation Angle:";
kIKScannerDeviceView_Advanced_DetectSeparateItems = "Detect Separate Items";

kIKScannerDeviceView_Advanced_Resolution = "Resolution:";
kIKScannerDeviceView_Advanced_ResolutionUnits = "dpi";

kIKScannerDeviceView_Advanced_Scaling = "Scaling:";
kIKScannerDeviceView_Advanced_ScalingUnits = "%";

kIKScannerDeviceView_Advanced_GeometrySize = "Size:";
kIKScannerDeviceView_Advanced_GeometryNewSize = "New Size:";
kIKScannerDeviceView_Advanced_GeometrySourceSize = "Source Size:";

kIKScannerDeviceView_Advanced_Template = "Template:";
kIKScannerDeviceView_Advanced_NoTemplate = "None";

kIKScannerDeviceView_Advanced_ScanTo = "Scan To:";
kIKScannerDeviceView_Advanced_ScanToFolder = "Scan To Folder:";

kIKScannerDeviceView_Advanced_ScanDocumentNameLabel = "Name:";
kIKScannerDeviceView_Advanced_ScanPostProcessingAppLabel = "Open with:";

kIKScannerDeviceView_Advanced_Format = "Format:";
kIKScannerDeviceView_Advanced_FormatBMP = "BMP";
kIKScannerDeviceView_Advanced_FormatGIF = "GIF";
kIKScannerDeviceView_Advanced_FormatJPEG = "JPEG";
kIKScannerDeviceView_Advanced_FormatJPEG2000 = "JPEG 2000";
kIKScannerDeviceView_Advanced_FormatPICT = "PICT";
kIKScannerDeviceView_Advanced_FormatPDF = "PDF";
kIKScannerDeviceView_Advanced_FormatPNG = "PNG";
kIKScannerDeviceView_Advanced_FormatPSD = "PSD";
kIKScannerDeviceView_Advanced_FormatQTIF = "QTIF";
kIKScannerDeviceView_Advanced_FormatSGI = "SGI";
kIKScannerDeviceView_Advanced_FormatTGA = "TGA";
kIKScannerDeviceView_Advanced_FormatTIFF = "TIFF";

kIKScannerDeviceView_Advanced_ImageCorrection = "Image Correction:";
kIKScannerDeviceView_Advanced_ImageCorrectionNone = "None";
kIKScannerDeviceView_Advanced_ImageCorrectionAutomatic = "Automatic";
kIKScannerDeviceView_Advanced_ImageCorrectionManual = "Manual";

kIKScannerDeviceView_Advanced_PaperSize = "Scan Size:";
kIKScannerDeviceView_Advanced_PaperSizeA4 = "A4";
kIKScannerDeviceView_Advanced_PaperSizeB5JIB5 = "B5/JIS B5";
kIKScannerDeviceView_Advanced_PaperSizeUSLetter = "US Letter";
kIKScannerDeviceView_Advanced_PaperSizeUSLegal = "US Legal";
kIKScannerDeviceView_Advanced_PaperSizeA5 = "A5";
kIKScannerDeviceView_Advanced_PaperSizeB4ISOB4 = "B4/ISO B4";
kIKScannerDeviceView_Advanced_PaperSizeB6ISOB6 = "B6/ISO B6";
kIKScannerDeviceView_Advanced_PaperSizeUSLedger = "US Ledger";
kIKScannerDeviceView_Advanced_PaperSizeUSExecutive = "US Executive";
kIKScannerDeviceView_Advanced_PaperSizeA3 = "A3";
kIKScannerDeviceView_Advanced_PaperSizeB3ISOB3 = "B3/ISO B3";
kIKScannerDeviceView_Advanced_PaperSizeA6 = "A6";
kIKScannerDeviceView_Advanced_PaperSizeC4 = "C4";
kIKScannerDeviceView_Advanced_PaperSizeC5 = "C5";
kIKScannerDeviceView_Advanced_PaperSizeC6 = "C6";
kIKScannerDeviceView_Advanced_PaperSize4A0 = "4A0";
kIKScannerDeviceView_Advanced_PaperSize2A0 = "2A0";
kIKScannerDeviceView_Advanced_PaperSizeA0 = "A0";
kIKScannerDeviceView_Advanced_PaperSizeA1 = "A1";
kIKScannerDeviceView_Advanced_PaperSizeA2 = "A2";
kIKScannerDeviceView_Advanced_PaperSizeA7 = "A7";
kIKScannerDeviceView_Advanced_PaperSizeA8 = "A8";
kIKScannerDeviceView_Advanced_PaperSizeA9 = "A9";
kIKScannerDeviceView_Advanced_PaperSizeA10 = "A10";
kIKScannerDeviceView_Advanced_PaperSizeISOB0 = "ISO B0";
kIKScannerDeviceView_Advanced_PaperSizeISOB1 = "ISO B1";
kIKScannerDeviceView_Advanced_PaperSizeISOB2 = "ISO B2";
kIKScannerDeviceView_Advanced_PaperSizeISOB5 = "ISO B5";
kIKScannerDeviceView_Advanced_PaperSizeISOB7 = "ISO B7";
kIKScannerDeviceView_Advanced_PaperSizeISOB8 = "ISO B8";
kIKScannerDeviceView_Advanced_PaperSizeISOB9 = "ISO B9";
kIKScannerDeviceView_Advanced_PaperSizeISOB10 = "ISO B10";
kIKScannerDeviceView_Advanced_PaperSizeJISB0 = "JIS B0";        
kIKScannerDeviceView_Advanced_PaperSizeJISB1 = "JIS B1";        
kIKScannerDeviceView_Advanced_PaperSizeJISB2 = "JIS B2";        
kIKScannerDeviceView_Advanced_PaperSizeJISB3 = "JIS B3";        
kIKScannerDeviceView_Advanced_PaperSizeJISB4 = "JIS B4";        
kIKScannerDeviceView_Advanced_PaperSizeJISB6 = "JIS B6";        
kIKScannerDeviceView_Advanced_PaperSizeJISB7 = "JIS B7";        
kIKScannerDeviceView_Advanced_PaperSizeJISB8 = "JIS B8";        
kIKScannerDeviceView_Advanced_PaperSizeJISB9 = "JIS B9";        
kIKScannerDeviceView_Advanced_PaperSizeJISB10 = "JIS B10";       
kIKScannerDeviceView_Advanced_PaperSizeC0 = "C0";            
kIKScannerDeviceView_Advanced_PaperSizeC1 = "C1";            
kIKScannerDeviceView_Advanced_PaperSizeC2 = "C2";            
kIKScannerDeviceView_Advanced_PaperSizeC3 = "C3";            
kIKScannerDeviceView_Advanced_PaperSizeC7 = "C7";            
kIKScannerDeviceView_Advanced_PaperSizeC8 = "C8";            
kIKScannerDeviceView_Advanced_PaperSizeC9 = "C9";            
kIKScannerDeviceView_Advanced_PaperSizeC10 = "C10";           
kIKScannerDeviceView_Advanced_PaperSizeUSStatement = "US Statement";  
kIKScannerDeviceView_Advanced_PaperSizeBusinessCard = "Business Card"; 

kIKScannerDeviceView_Advanced_PaperSizeTypeE = "3.25” x 4.5”";
kIKScannerDeviceView_Advanced_PaperSizeType3R = "3.5” x 5”";
kIKScannerDeviceView_Advanced_PaperSizeType4R = "4” x 6”";
kIKScannerDeviceView_Advanced_PaperSizeType5R = "5” x 7”";
kIKScannerDeviceView_Advanced_PaperSizeType6R = "6” x 8”";
kIKScannerDeviceView_Advanced_PaperSizeType8R = "8” x 10”";
kIKScannerDeviceView_Advanced_PaperSizeTypeS8R = "8” x 12”";
kIKScannerDeviceView_Advanced_PaperSizeType10R = "10” x 12”";
kIKScannerDeviceView_Advanced_PaperSizeTypeS10R = "10” x 15”";
kIKScannerDeviceView_Advanced_PaperSizeType11R = "11” x 14”";
kIKScannerDeviceView_Advanced_PaperSizeType12R = "12” x 15”";
kIKScannerDeviceView_Advanced_PaperSizeTypeS12R = "12” x 18”";


kIKScannerDeviceView_Advanced_Duplex = "Duplex";
kIKScannerDeviceView_Advanced_Orientation = "Orientation:";

kIKScannerDeviceView_Advanced_ToolTip_Orientation1 = "Original is not rotated";
kIKScannerDeviceView_Advanced_ToolTip_Orientation3 = "Original is rotated 180°";
kIKScannerDeviceView_Advanced_ToolTip_Orientation6 = "Original is rotated left";
kIKScannerDeviceView_Advanced_ToolTip_Orientation8 = "Original is rotated right";

kIKScannerDeviceView_Advanced_ToolTip_OrientationOdd1 = "Odd page numbers - Original is not rotated";
kIKScannerDeviceView_Advanced_ToolTip_OrientationOdd3 = "Odd page numbers - Original is rotated 180°";
kIKScannerDeviceView_Advanced_ToolTip_OrientationOdd6 = "Odd page numbers - Original is rotated left";
kIKScannerDeviceView_Advanced_ToolTip_OrientationOdd8 = "Odd page numbers - Original is rotated right";

kIKScannerDeviceView_Advanced_ToolTip_OrientationEven1 = "Even page numbers - Original is not rotated";
kIKScannerDeviceView_Advanced_ToolTip_OrientationEven3 = "Even page numbers - Original is rotated 180°";
kIKScannerDeviceView_Advanced_ToolTip_OrientationEven6 = "Even page numbers - Original is rotated left";
kIKScannerDeviceView_Advanced_ToolTip_OrientationEven8 = "Even page numbers - Original is rotated right";

kIKScannerDeviceView_Advanced_AX_Orientation1 = "original is not rotated";
kIKScannerDeviceView_Advanced_AX_Orientation3 = "original is rotated 180°";
kIKScannerDeviceView_Advanced_AX_Orientation6 = "original is rotated left";
kIKScannerDeviceView_Advanced_AX_Orientation8 = "original is rotated right";

kIKScannerDeviceView_Advanced_CombineScansIntoSingleDoc = "Create single document";

kIKScannerDeviceView_Advanced_Reset = "Restore Defaults";
kIKScannerDeviceView_Advanced_Contrast = "Contrast:";
kIKScannerDeviceView_Advanced_Brightness = "Brightness:";
kIKScannerDeviceView_Advanced_Saturation = "Saturation:";
kIKScannerDeviceView_Advanced_Temperature = "Temperature:";
kIKScannerDeviceView_Advanced_Tint = "Tint:";
kIKScannerDeviceView_Advanced_Dark = "Dark";
kIKScannerDeviceView_Advanced_Midtones = "Midtones";
kIKScannerDeviceView_Advanced_Light = "Light";

kIKScannerDeviceView_Advanced_scalingFormatString = "#,##0";
/* kIKScannerDeviceView_Advanced_resolutionFormatString = "#,##0"; */
kIKScannerDeviceView_Advanced_resolutionFormatString = "0";
kIKScannerDeviceView_Advanced_sizeFormatStringPixel = "#,##0";
kIKScannerDeviceView_Advanced_sizeFormatStringInch = "#,##0.00";
kIKScannerDeviceView_Advanced_sizeFormatStringCM = "#,##0.00";

kIKScannerDeviceView_DocumentFeederNoPaperLoaded = "No paper loaded…";
